# IsValid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..IsValid Property
MEPSystem Class See Also
---
Indicates if the system is valid or not. atom AtomValidateSystem default false
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsValid { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsValid As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsValid {
	bool get ();
}
```

# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace